{"genre":"rock","lyrics":"Don't wanna be an American idiot. Don't want a nation under the new mania And can you hear the sound of hysteria? The subliminal mind fuck America. Welcome to a new kind of tension. All across the alienation. Where everything isn't meant to be okay. Television dreams of tomorrow. We're not the ones who're meant to follow. For that's enough to argue. Well maybe I'm the faggot America. I'm not a part of a redneck agenda. Now everybody do the propaganda. And sing along to the age of paranoia. Welcome to a new kind of tension. All across the alienation. Where everything isn't meant to be okay. Television dreams of tomorrow. We're not the ones who're meant to follow. For that's enough to argue. Don't want to be an American idiot. One nation controlled by the media. Information age of hysteria. It's calling out to idiot America. Welcome to a new kind of tension. All across the alienation. Where everything isn't meant to be okay. Television dreams of tomorrow. We're not the ones who're meant to follow. For that's enough to argue."}
{"genre":"rock","lyrics":"I walk a lonely road The only one that I have ever known Don't know where it goes But it's home to me and I walk alone I walk this empty street On the Boulevard of Broken Dreams Where the city sleeps And I'm the only one and I walk alone I walk alone I walk alone I walk alone I walk a... My shadow's the only one that walks beside me My shallow heart's the only thing that's beating Sometimes I wish someone out there will find me 'Til then I walk alone Ah-ah, ah-ah, ah-ah, aaah-ah, Ah-ah, ah-ah, ah-ah I'm walking down the line That divides me somewhere in my mind On the border line Of the edge and where I walk alone Read between the lines Of what's fucked up and everything's alright Check my vital signs To know I'm still alive and I walk alone I walk alone I walk alone I walk alone I walk a... My shadow's the only one that walks beside me My shallow heart's the only thing that's beating Sometimes I wish someone out there will find me 'Til then I walk alone Ah-ah, ah-ah, ah-ah, aaah-ah Ah-ah, ah-ah I walk alone I walk a... I walk this empty street On the Boulevard of Broken Dreams Where the city sleeps And I'm the only one and I walk a... My shadow's the only one that walks beside me My shallow heart's the only thing that's beating Sometimes I wish someone out there will find me 'Til then I walk alone"}
{"genre":"country","lyrics":"You, with your words like knives And swords and weapons that you use against me You, have knocked me off my feet again, Got me feeling like a nothing You, with your voice like nails On a chalk board, calling me out when I'm wounded You, picking on the weaker man You can take me down With just one single blow But you don't know what you don't know Someday I'll be living in a big old city And all you're ever gonna be is mean Someday I'll be big enough so you can't hit me And all you're ever gonna be is mean Why you gotta be so mean? You, with your switching sides And your wildfire lies and your humiliation You have pointed out my flaws again As if I don't already see them I walk with my head down, Try to block you out 'cause I never impress you I just want to feel okay again I bet you got pushed around Somebody made you cold but the cycle ends right now 'Cause you can't lead me down that road And you don't know what you don't know Someday I'll be living in a big old city And all you're ever gonna be is mean Someday I'll be big enough so you can't hit me And all you're ever gonna be is mean Why you gotta be so mean? And I can see you years from now in a bar Talking over a football game With that same big loud opinion But nobody's listening, washed up and ranting About the same old bitter things Drunk and grumbling on about how I can't sing But all you are is mean All you are is mean and a liar and pathetic And alone in life and mean, and mean, and mean, and mean But someday I'll be living in a big old city And all you're ever gonna be is mean Yeah someday I'll be big enough So you can't hit me And all you're ever gonna be is mean Why you gotta be so (mean) Someday I'll be living in a big old city (Why you gotta be so mean) And all you're ever gonna be is mean (Why you gotta be so mean) Someday I'll be big enough so you can't hit me (Why you gotta be so mean) And all you're ever gonna be is mean Why you gotta be so mean?"}
{"genre":"rnb","lyrics":"I don't fuck with you You little stupid ass bitch, I ain't fuckin' with you You little, you little dumb ass bitch, I ain't fuckin' with you I got a million trillion things I'd rather fuckin' do Than to be fuckin' with you Little stupid ass, I don't give a fuck I don't give a fuck, I don't I don't I don't give a fuck Bitch I don't give a fuck about you or anything that you do Don't give a fuck about you or anything that you do [Verse 1 - Big Sean:] I heard you got a new man, I see you takin' a pic Then you post it up, thinkin' that it's makin' me sick I see you calling, I be makin' it quick I'm a answer that shit like: I don't fuck with you Bitch I got no feelings to go I swear I had it up to here, I got no ceilings to go I mean for real, fuck how you feel Fuck your two cents if it ain't goin' towards the bill, yeah And everyday I wake up celebrating shit, why? Cause I just dodged a bullet from a crazy bitch I stuck to my guns, that's what made me rich That's what put me on, that's what got me here That's what made me this And everything that I do is my first name These hoes chase bread, aw damn, she got a bird brain Ain't nothin' but trill in me, aw man, silly me I just bought a crib, three stories, that bitch a trilogy And you know I'm rollin' weed that's fuckin' up the ozone I got a bitch that text me, she ain't got no clothes on And then another one text, then your ass next And I'm gonna text your ass back like [Hook - Big Sean:] I don't fuck with you You little stupid ass bitch, I ain't fuckin' with you You little, you little dumb ass bitch, I ain't fuckin' with you I got a million trillion things I'd rather fuckin' do Than to be fuckin' with you Little stupid ass, I don't give a fuck I don't give a fuck, I don't I don't I don't give a fuck Bitch I don't give a fuck about you or anything that you do Don't give a fuck about you or anything that you do [Verse 2 - E-40:] Got a million things on my mind Executive deals online, limited amount of time Chasin' these dollar signs and you ain't on your grind You liable to find me up in the MGM casino in the D Fuckin' off fetti I could've put on property From the Bay to the Murder Mitten, my niggas put murder missions She choosin that's her decision, free my niggas in prison On the phone with a bitch who can't do shit For a pimp but make a nigga hella rich Got a blunt in my dental, blowin hemp in a rental On my way, to Sacramento, late night, Arsenio I'm never sentimental, go hard or go homeless Barely hardly, I'm chromeless, you might end up domeless I bet you she into me, her cheddar, she givin' me I make a bitch stand outside forever like the Statue of Liberty Rest in pimp, Pimp C, underground king of the South I raise my Styrofoam up, and pour some drink in my mouth Pour up Why you always coming around with bad news? (bad news) Say you want me to win, but hope I lose Asking if I rock with other niggas in the crew But them niggas cool, it's just that [Hook - Big Sean:] Bitch I ain't fuckin with you (bitch) You little stupid ass bitch, I ain't fuckin' with you (aha) You little, you little dumb ass bitch, I ain't fuckin' with you I got a million trillion things I'd rather fuckin' do Than to be fuckin' with you Little stupid ass, I don't give a fuck I don't give a fuck, I don't I don't I don't give a fuck Bitch I don't give a fuck about you or anything that you do Don't give a fuck about you or anything that you do I don't give a fuck I don't give a fuck, I don't I don't I don't give a fuck Bitch I don't give a fuck about you or anything that you do [Verse 3 - Big Sean:] I got a new chick that I gotta thank God for I got a new whip gotta thank the lot for Yeah I got a lot but want a lot more Yeah we in the buildin' but I'm tryna take it to the top floor I swear I hear some new bullshit everyday I'm wakin' up It seems like nowadays everybody breakin' up That shit can break you down if you lose a good girl I guess you need a bad bitch to come around and make it up I guess drama makes for the best content Everything got a bad side, even a conscience Now you're drinkin' 'til your unconscious Feel me when you get a fine bitch Just don't forget to read the fine print Life got me meditatin' like I'm in the Himalayas Keep it G with the L lit on me like I'm in the elevator Yeah I know that karma too real so I hope you doin' cool But still stupid ass bitch I ain't fuckin' with you (no no no) Little stupid ass I ain't fuckin with I ain't fuckin', I ain't I ain't fuckin' with you I ain't fuckin' with you Straight up Yay yay Whoa"}
{"genre":"country","lyrics":"I never thought you'd pick up the phone It's Friday night you should be out on the town Didn't think you'd be Sitting at home all alone like me Nothing on TV, nothing to do Nothing to keep my mind off you and me And the way it was Are you thinking 'bout it now because... ...I could be there in five? One more, one last time We don't have to be lonely tonight (Need you, want you, I'm right here) We don't have to be lonely tonight (I know we shouldn't, but I don't care) I don't wanna be right, I don't wanna be strong I just wanna hold you 'til the heartbreak's gone When the sun comes up, we can both move on But we don't have to be lonely tonight That taste, that touch, the fire I miss Those kiss-me eyes, your red wine lips on mine Like it used to be, Baby, I want you, and you want me We don't have to be lonely tonight (Need you, want you, I'm right here) We don't have to be lonely tonight (I know we shouldn't, but I don't care) I don't wanna be right, I don't wanna be strong I just wanna hold you 'til the heartbreak's gone When the sun comes up, we can both move on But we don't have to be lonely tonight I can be there in five One more, one last time We don't have to be lonely tonight (Oh, I need you and I'm right here) We don't have to be lonely tonight... tonight... tonight Yeah... yeah."}
{"genre":"rock","lyrics":"Livin' easy Livin' free Season ticket on a one way ride Askin' nothin' Leave me be Takin' everythin' in my stride Don't need reason Don't need rhyme Ain't nothin' that I'd rather do Goin' down Party time My friends are gonna be there too I'm on the highway to hell On the highway to hell Highway to hell I'm on the highway to hell No stop signs Speed limit Nobody's gonna slow me down Like a wheel Gonna spin it Nobody's gonna mess me around Hey, Satan Payin' my dues Playin' in a rockin' band Hey, mamma Look at me I'm on the way to the promised land I'm on the highway to hell Highway to hell I'm on the highway to hell Highway to hell Don't stop me I'm on the highway to hell On the highway to hell I'm on the highway to hell On the highway to hell (highway to hell) I'm on the highway to hell (highway to hell) highway to hell (highway to hell) highway to hell (highway to hell) And I'm goin' down All the way I'm on the highway to hell"}
{"genre":"country","lyrics":"Well it's a long way from Star, Mississippi To the big stage I'm singing on tonight And sometimes the butterflies still get me When I'm in the spotlight And some people seem to think that I've changed That I'm different than I was back then But in my soul I know that I'm the same way That I really always been [Chorus:] Cause a Mississippi girl don't change her ways Just cause everybody knows her name Ain't big-headed from a little bit of fame I still like wearing my old ball cap Ride my kids around piggy back They might know me all around this world But y'all I'm still a Mississippi girl Well I spent a few weeks in California They put my face on the big movie screen But that don't mean I've forgotten where I came from That's just me chasing dreams, yeah [Chorus:] Cause a Mississippi girl don't change her ways Just cause everybody knows her name Ain't big headed from a little bit of fame I still like wearing my old ball cap Ride my kids around piggy back They might know me all around this world But y'all I'm still a Mississippi girl Cause a Mississippi girl don't change her ways Just cause everybody knows her name Ain't big headed from a little bit of fame I still like wearing my old ball cap Ride my kids around piggy back They might know me all around this world But y'all I'm still a Mississippi girl Mississippi girl oh Mississippi girl Mississippi girl yeah yeah oh oh Mississippi girl"}
{"genre":"country","lyrics":"Well, I got my first truck when I was three Drove a hundred thousand miles on my knees I hauled marbles and rocks and thought twice before I hauled a Barbie doll bed for the girl next door She tried to pay me with a kiss and I began to understand There's something women like about a pickup man When I turned sixteen I saved a few hundred bucks My first car was a pickup truck I was cruisin' the town and the first girl I see Is Bobbie Joe Gentry, the homecoming queen She flagged me down and climbed up in the cab And said I never knew you were a pickup man! You can set my truck on fire and roll it down a hill And I still wouldn't trade it for a Coupe de Ville I've got an eight-foot bed that never has to be made You know if it weren't for truck we wouldn't have tailgates I met all my wives in traffic jams There's just something women like about a pickup man Most Friday nights I can be found In the bed of my truck on an old chaisse lounge Backed into my spot at the drive-in show You know a cargo light gives off a romantic glow I never have to wait in line at the popcorn stand Cuz there's something women like about a pickup man You can set my truck on fire and roll it down a hill And I still wouldn't trade it for a Coupe de Ville I've got an eight-foot bed that never has to be made You know if it weren't for truck we wouldn't have tailgates I met all my wives in traffic jams There's just something women like about a pickup man You can set my truck on fire and roll it down a hill And I still wouldn't trade it for a Coupe de Ville I've got an eight-foot bed that never has to be made You know if it weren't for truck we wouldn't have tailgates I met all my wives in traffic jams There's just something women like about a pickup man Yes there's something women like about a pickup man"}
{"genre":"pop","lyrics":"There's a stranger in my bed, There's a pounding my head Glitter all over the room Pink flamingos in the pool I smell like a minibar DJ's passed out in the yard Barbie's on the barbecue This a hickey or a bruise? Pictures of last night Ended up online I'm screwed Oh well It's a blacked out blur But I'm pretty sure it ruled, damn Last Friday night Yeah we danced on tabletops And we took too many shots Think we kissed but I forgot Last Friday night Yeah we maxed our credit cards And got kicked out of the bar So we hit the boulevard Last Friday night We went streaking in the park Skinny dipping in the dark Then had a menage a trois Last Friday night Yeah I think we broke the law Always say we're gonna stop-op Whoa-oh-oah This Friday night Do it all again This Friday night Do it all again Trying to connect the dots Don't know what to tell my boss Think the city towed my car Chandelier is on the floor Ripped my favorite party dress Warrants out for my arrest Think I need a ginger ale That was such an epic fail Pictures of last night Ended up online We're screwed Oh well It's a blacked out blur But I'm pretty sure it ruled Damn Last Friday night Yeah we danced on table tops And we took too many shots Think we kissed but I forgot Last Friday night Yeah we maxed our credits card And got kicked out of the bars So we hit the boulevards Last Friday night We went streaking in the park Skinny dipping in the dark Then had a menage a trois Last Friday night Yeah I think we broke the law Always say we're gonna stop-op Oh whoa This Friday night Do it all again This Friday night Do it all again This Friday night T.G.I.F. T.G.I.F. T.G.I.F. T.G.I.F. T.G.I.F. T.G.I.F. Last Friday night Yeah we danced on table tops And we took too many shots Think we kissed but I forgot Last Friday night Yeah we maxed our credit cards And got kicked out of the bar So we hit the boulevard Last Friday night We went streaking in the park Skinny dipping in the dark Then had a menage a trois Last Friday night Yeah I think we broke the law Always say we're gonna stop-op Whoa-oh This Friday night Do it all again"}
{"genre":"pop","lyrics":"I gotta feeling that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night A feeling that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night A feeling, woohoo, that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night A feeling, woohoo, that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night Tonight's the night, let's live it up I got my money, let's spend it up Go out and smash it like oh my God Jump off that sofa, let's get, get off I know that we'll have a ball If we get down and go out and just lose it all I feel stressed out, I wanna let it go Let's go way out spaced out and losing all control Fill up my cup, mozoltov Look at her dancing, just take it off Let's paint the town, we'll shut it down Let's burn the roof, and then we'll do it again Let's do it, let's do it, let's do it, let's do it And do it and do it, let's live it up And do it and do it and do it, do it, do it Let's do it, let's do it, let's do it 'Cause I gotta feeling, woohoo, that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night A feeling, woohoo, that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night Tonight's the night (Hey!) Let's live it up (Let's live it up) I got my money (My pay) Let's spend it up (Let's spend it up) Go out and smash it (Smash it) Like oh my God (Like oh my God) Jump off that sofa (Come on!) Let's get, get off Fill up my cup (Drink) Mozoltov (Lahyme) Look at her dancing (Move it, move it) Just take it off Let's paint the town (Paint the town) We'll shut it down (Let's shut it down) Let's burn the roof And then we'll do it again Let's do it, let's do it, let's do it, let's do it And do it and do it, let's live it up And do it and do it and do it, do it, do it Let's do it, let's do it, let's do it, do it, do it, do it Here we come, here we go, we gotta rock (Rock rock rock rock rock) Easy come, easy go, now we on top (Top top top top top) Feel the shot, body rock, rock it, don't stop (Stop stop stop stop stop) Round and round, up and down, around the clock (Rock rock rock rock rock) Monday, Tuesday, Wednesday and Thursday (Do it!) Friday, Saturday, Saturday to Sunday (Do it!) Get, get, get, get, get with us, you know what we say, say Party every day, p-p-p-party every day And I'm feelin', woohoo, that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night I gotta feeling, woohoo, that tonight's gonna be a good night That tonight's gonna be a good night That tonight's gonna be a good, good night Woohoo"}
{"genre":"pop","lyrics":"I hopped off the plane at L.A.X. with a dream and my cardigan Welcome to the land of fame, excess, whoa! am I gonna fit in? Jumped in the cab, here I am for the first time Look to my right, and I see the Hollywood sign This is all so crazy, everybody seems so famous My tummy's turnin' and I'm feelin' kinda homesick Too much pressure and I'm nervous That's when the taxi man turned on the radio And the Jay-Z song was on And the Jay-Z song was on And the Jay-Z song was on So I put my hands up, they're playin' my song The butterflies fly away I'm noddin' my head like Yeah! Movin' my hips like Yeah! Got my hands up, they're playin' my song And now I'm gonna be okay Yeah! It's a party in the USA! Yeah! It's a party in the USA!"}
{"genre":"rnb","lyrics":" I see you driving 'round town with the girl I love and I'm like, FUCK YOU! Ooo,ooo,oooo I guess the change in my pocket wasn't enough I'm like, FUCK YOU! And fuck her too. I said, If I was richer, I'd still be with ya Ha, now ain't that some shit? (Ain't that some shit?) And although there's pain in my chest I still wish you the best With a... FUCK YOU! Ooo,ooo,ooo Yeah I'm sorry, I can't afford a Ferrari, But that don't mean I can't get you there. I guess he's an Xbox and I'm more Atari, But the way you play your game ain't fair. I pity the fool That falls in love with you (Oh shit she's a golddigger) Well (Just thought you should know nigga) Oooooooooh I've got some news for you. Yeah go run and tell your little boyfriend. I see you driving 'round town with the girl I love and I'm like, FUCK YOU! Ooo,ooo,oooo I guess the change in my pocket wasn't enough I'm like, FUCK YOU! And fuck her too. I said, If I was richer, I'd still be with ya Ha, now ain't that some shit? (Ain't that some shit?) And although there's pain in my chest I still wish you the best With a... FUCK YOU! Ooo,ooo,ooo Now I know, That I had to borrow, Beg and steal and lie and cheat. Trying to keep ya, Trying to please ya. 'Cause being in love with your ass ain't cheap. I pity the fool That falls in love with you (Oh shit she's a golddigger) Well (Just thought you should know nigga) Oooooooooh I've got some news for you. Ooh, I really hate your ass right now. I see you driving 'round town with the girl I love and I'm like, FUCK YOU! Ooo,ooo,oooo I guess the change in my pocket wasn't enough I'm like, FUCK YOU! And fuck her too. I said, If I was richer, I'd still be with ya Ha, now ain't that some shit? (Ain't that some shit?) And although there's pain in my chest I still wish you the best With a... FUCK YOU! Ooo,ooo,ooo Now baby, baby, baby, why d'you wanna wanna hurt me so bad? (So bad, so bad, so bad) I tried to tell my mamma but she told me This is one for your dad. (Your dad, your dad, your dad) UH! Whhhhy? Uh! Whhhhy? Uh! Whhhhy lady? Oh! I love you. Oh! I still love you. Oooh! I see you driving 'round town with the girl I love and I'm like, FUCK YOU! Ooo,ooo,oooo I guess the change in my pocket wasn't enough I'm like, FUCK YOU! And fuck her too. I said, If I was richer, I'd still be with ya Ha, now ain't that some shit? (Ain't that some shit?) And although there's pain in my chest I still wish you the best With a... FUCK YOU! Ooo,ooo,ooo"}
{"genre":"rnb","lyrics":"I just wanna fuck I just wanna fuck I just wanna fuck I just wanna fuck [Hook: Jeremih & Post Malone] I ain't here for no conversation I ain't really tryna talk Can a nigga be honest baby? (I just wanna fuck) I just came here to fuck Shawty take of them heels and your shirt And that skirt and them panties right now (I just wanna fuck, I just wanna...) Baby step into my room, show me love And get served like tennis right now If you wanna come and get served right now Then you know it's goddamn guaranteed to go down [Verse 1: Post Malone] I'm going down, you're going down It's going down for sure Baby girl sit down right now Give you five seconds, one, two, three, four I'mma turn your ass around, right now Now you're screaming Good Lord Got you smoking on the loud, knock you down Fuck you like you never been before I could fuck you all the tiiiiime Girl I'm glad you're miiiiine [Hook: Jeremih & Post Malone] I ain't here for no conversation I ain't really tryna talk Can a nigga be honest baby? (I just wanna fuck) I just came here to fuck Shawty take of them heels and your shirt And that skirt and them panties right now (I just wanna fuck, I just wanna...) Baby step into my room, show me love And get served like tennis right now If you wanna come and get served right now Then you know it's goddamn guaranteed to go down [Verse 2: Post Malone] Go down, hell yeah, I'mma say it Go and show me what you working with Give a fuck about the man that you rolling with Think it's 'bout damn time that you done with him How you get so bad? We all wonderin' Lil mama look hotter than the summer is I ain't gonna tell you lies like the other did Baby girl, I'mma keep it one hundred Get me on, I'mma, I'mma call you later And these Saint Laurent's looking alligator And maybe that's why she want an elevator Elevate your life, elevate your life Girl you know I wouldn't wanna wife ya Girl I wouldn't wanna make you spiteful Girl I wouldn't wanna mix your life up Mix your life up... [Bridge: Jeremih] Yeah I was tryna get her to my bed But we ain't make it out the kitchen (I just wanna fuck) I was cooking and I burned the bacon, damn Pussy got a nigga slippin', yeah Got your boy going deep: breast stroke, back stroke Girl I'm swimming right now (I just wanna fuck) Got her singing like me, when she moan Let's make a song, and we're jamming right now [Outro: Post Malone] I could fuck you all the ti-i-i-i-i-i-i-ime Girl I'm glad you're m-i-i-i-i-i-ine"}
{"genre":"pop","lyrics":"Same bed but it feels just a little bit bigger now Our song on the radio but it don't sound the same When our friends talk about you, all it does is just tear me down 'Cause my heart breaks a little when I hear your name It all just sounds like oooooh… Mmm, too young, too dumb to realize That I should've bought you flowers And held your hand Should've gave you all my hours When I had the chance Take you to every party 'Cause all you wanted to do was dance Now my baby's dancing But she's dancing with another man My pride, my ego, my needs, and my selfish ways Caused a good strong woman like you to walk out my life Now I never, never get to clean up the mess I made, ohh… And it haunts me every time I close my eyes It all just sounds like oooooh… Mmm, too young, too dumb to realize That I should've bought you flowers And held your hand Should've gave you all my hours When I had the chance Take you to every party 'Cause all you wanted to do was dance Now my baby's dancing But she's dancing with another man Although it hurts I'll be the first to say that I was wrong Oh, I know I'm probably much too late To try and apologize for my mistakes But I just want you to know I hope he buys you flowers I hope he holds your hand Give you all his hours When he has the chance Take you to every party 'Cause I remember how much you loved to dance Do all the things I should have done When I was your man Do all the things I should have done When I was your man"}
{"genre":"rnb","lyrics":"So what we get drunk So what we smoke weed We're just having fun We don't care who sees So what we go out That's how it's supposed to be Living young and wild and free1 Uh, uh huh So what I keep 'em rolled up Saggin' my pants not caring what I show Keep it real with my niggas Keep it player for the hoes And look clean don't it? Washed it the other day, watch how you lean on it Give me some 501's jeans on and roll joints bigger than King Kong's fingers And smoke them hoes down 'till they stingers You a class clown and if I skip for the day I'm with you bitch smokin' grade A You know what? It's like I'm seventeen again Peach fuzz on my face Lookin', on the case Tryna find a hella taste Oh My God, I'm on the chase Chevy, its gettin' kinda heavy, relevant, sellin' it Dippin' away, time keep slippin' away Zip in the safe, flippin' for pay Tippin' like I'm drippin' in paint Up front four blunts, like Khalifa put the weed in a J So what we get drunk So what we smoke weed We're just having fun We don't care who sees So what we go out That's how it's supposed to be Living young and wild and free Uh, and now I don't even care 'Cause me and my team in here There's gon' be some weed in the air Tell 'em Mac Blowin' everywhere we goin' And now ya knowin' When I step right up Get my lighter so I can light up That's how it should be done Soon as you thinkin' you're down Find how to turn things around Now things are looking up From the ground up Pound up It's Taylor Gang So turn my sound up And mount up And do my thang Now I'm chillin' Fresh outta class feelin' Like I'm on my own And I could probably own a building Got my own car No job, no children Had this science project Me and Mac killed it T-H-C M-A-C D-E-V H-D-3 High as me This is us We gon' fuss And we gon' fight And we gon' roll And live our life So what we get drunk So what we smoke weed We're just having fun We don't care who sees So what we go out That's how it's supposed to be Living young and wild and free Yea, roll one, smoke one When you live like this you're supposed to party Roll one, smoke one, and we all just having fun So we just, roll one, smoke one When you live like this you're supposed to party Roll one, smoke one, and we all just having fun So what we get drunk So what we smoke weed We're just having fun We don't care who sees So what we go out That's how it's supposed to be Living young and wild and free"}
{"genre":"pop","lyrics":"I stay out too late, got nothing in my brain That's what people say, that's what people say I go on too many dates, but I can't make them stay At least that's what people say, that's what people say But I keep cruising Can't stop, won't stop moving It's like I got this music in my mind Saying it's gonna be alright Cause the players gonna play, play, play, play, play And the haters gonna hate, hate, hate, hate, hate Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Heartbreakers gonna break, break, break, break, break And the fakers gonna fake, fake, fake, fake, fake Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off I never miss a beat, I'm lightning on my feet And that's what they don’t see, that's what they don’t see I'm dancing on my own, I make the moves up as I go And that's what they don't know, that’s what they don’t know But I keep cruising Can't stop, won't stop grooving It's like I got this music in my mind Saying it's gonna be alright Cause the players gonna play, play, play, play, play And the haters gonna hate, hate, hate, hate, hate Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Heartbreakers gonna break, break, break, break, break And the fakers gonna fake, fake, fake, fake, fake Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off Hey, hey, hey! Just think while you've been getting down and out about the liars And dirty, dirty cheats of the world you could've been getting down to this sick beat My ex-man brought his new girlfriend She's like, oh my God, but I'm just gonna shake And to the fella over there with the hella good hair Won't you come on over, baby, we can shake, shake, shake Cause the players gonna play, play, play, play, play And the haters gonna hate, hate, hate, hate, hate Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Heartbreakers gonna break, break, break, break, break And the fakers gonna fake, fake, fake, fake, fake Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off I, I shake it off, I shake it off"}
{"genre":"rock","lyrics":"Do you know what's worth fighting for When it's not worth dying for? Does it take your breath away And you feel yourself suffocating Does the pain weigh out the pride? And you look for a place to hide Did someone break your heart inside You're in ruins One, 21 Guns Lay down your arms Give up the fight One, 21 Guns Throw up your arms into the sky You and I... When you're at the end of the road And you lost all sense of control And your thoughts have taken their toll When your mind breaks the spirit of your soul Your faith walks on broken glass And the hangover doesn't pass Nothing's ever built to last You're in ruins One, 21 Guns Lay down your arms Give up the fight One, 21 Guns Throw up your arms into the sky You and I... Did you try to live on your own When you burned down the house and home Did you stand too close to the fire? Like a liar looking for forgiveness from a stone When it's time to live and let die And you can't get another try Something inside this heart has died You're in ruins One, 21 Guns Lay down your arms Give up the fight One, 21 Guns Throw up your arms into the sky One, 21 Guns Lay down your arms Give up the fight One, 21 Guns Throw up your arms into the sky You and I"}
{"genre":"rnb","lyrics":"My mama called, seen you on TV, son Said shit done changed ever since we was on I dreamed it all ever since I was young They said I wouldn't be nothing Now they always say congratulations Worked so hard, forgot how to vacation They ain't never had the dedication People hatin', say we changed and look we made it Yeah, we made it They was never friendly, yeah Now I'm jumping out the Bentley, yeah And I know I sound dramatic, yeah But I knew I had to have it, yeah For the money, I'm a savage, yeah Got me itching like a habit, yeah I'm surrounded twenty bad bitch, yeah But they didn't know me last year, yeah Everyone wanna act like they important (Yeah-yeah-yeah, yeah-yeah-yeah) But all that mean nothing when I saw my dog (Yeah-yeah-yeah, yeah-yeah-yeah) Everyone counting on me drop the ball (Yeah-yeah-yeah, yeah-yeah-yeah) Everything custom like I'm at the border, yeah, yeah If you fuck with winning, put your lighters to the sky How could I make sense when I got millions on my mind? Coming with that bullshit, I just put it to the side Balling since a baby, they could see it in my eyes My mama called, seen you on TV, son Said shit done changed ever since we was on I dreamed it all ever since I was young They said I wouldn't be nothing Now they always say congratulations Worked so hard, forgot how to vacation They ain't never had the dedication People hatin', say we changed and look we made it Yeah, we made it I was patient, yeah-oh I was patient, ay-oh Now I can scream that we made it Now everyone, everywhere I go, they say 'gratulations Young nigga, young nigga, graduation I pick up the rock and I ball, baby I'm looking for someone to call, baby But right now I got a situation Never old, been Ben Franklins Big rings, champagne My life is like a ball game But instead I'm in the trap, though Pot so big, call it Super Bowl Super Bowl, call the hoes, get in the Rolls Top floor lifestyle, Honcho and Post Malone, I got a play on my phone, ay You know what I'm on, ay Huncho Houdini is gone, ay My mama called, seen you on TV, son Said shit done changed ever since we was on I dreamed it all ever since I was young They said I wouldn't be nothing Now they always say congratulations Worked so hard, forgot how to vacation They ain't never had the dedication People hatin', say we changed and look we made it Yeah, we made it"}
